package Seminar3;
/*https://github.com/Liberate520/studentsGroup/tree/master/src/students
 * Задача 1 - Iterator
📌 Создать класс Студент
📌 Создать класс УчебнаяГруппа
📌 Создать класс УчебнаяГруппаИтератор, заставив его реализовать
интерфейс Iterator
📌 Реализовать его контракты (включая удаление)
Задача 2 - Iterable
📌 Модифицировать класс УчебнаяГруппа, заставив его реализовать
интерфейс Iterable
📌 Реализовать метод iterator() возвращающий экземпляр созданного нами
итератора
📌 Создать класс УчебнаяГруппаСервис, добавив в него метод удаления
студента по ФИО
📌 Создать класс Контроллер, добавив в него метод удаления студента и
вызывать в нем созданный метод из УчебнаяГруппаСервис
Задача 3 - Comparable
📌 Модифицировать класс Студент, заставив его реализовать интерфейс
Comparable
📌 Реализовать контракт compareTo () со сравнением по какому-либо
параметру (пример studentId)
📌 Модифицировать класс УчебнаяГруппаСервис, добавив в него метод
сортировки списка студентов по id
📌 Модифицировать класс Контроллер, добавив в него метод сортировки
списка студентов по id и вызывать в нем созданный метод из
УчебнаяГруппаСервис
Задача 4 - Comparator
📌 Создать класс СтудентКомпаратор реализующий интерфейс Comparator
📌 Реализовать контракт compare () со сравнением по какому-либо параметру
(пример: сочетание Имя+Фамилия)
📌 Модифицировать класс УчебнаяГруппаСервис, добавив в него метод
сортировки списка студентов по ФИО
📌 Модифицировать класс Контроллер, добавив в него метод сортировки
списка студентов по ФИО и вызывать в нем созданный метод из
УчебнаяГруппаСервис
 */

//import students.studentGroup.StudyGroup;

public class Main {
    public static void main(String[] args) {
        Service service = new Service();
        service.addStudent("Маша", 18);
        service.addStudent("Паша", 20);
        service.addStudent("Даша", 19);
        service.addStudent("Саша", 22);

        System.out.println(service.getInfo());

        service.sortByName();
        System.out.println(service.getInfo());

        service.sortByAge();
        System.out.println(service.getInfo());

        StudyGroup<Teacher> studyGroup = new StudyGroup<>();
    }
}
